Revit 2027 API
BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeWarning Property
 You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeWarning { get; }
Public Shared ReadOnly Property AttemptToConnectNonSlopingElementToSlopedPipeWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AttemptToConnectNonSlopingElementToSlopedPipeWarning {
	FailureDefinitionId^ get ();
}
static member AttemptToConnectNonSlopingElementToSlopedPipeWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace